/*
1. Написать программу, которая выводит на экран равнобедренный
треугольник. При этом пользователь вводит высоту треугольника.
*/

#include <iostream>
using std::cout;
using std::cin;
using std::endl;

int main()
{
	setlocale(LC_ALL, ""); // работает только с потоком вывода

	cout << "Введите высоту равнобедренного треугольника: " << endl;
	int height{ 0 };
	cin >> height;







	return 0;
}